app/views/shared/_user_info.html.haml

%span
  = pluralize(current_user.microposts.count, "micropost")
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1